### Terraform Plan — `dev` ✅

<details><summary>Show plan</summary>

```hcl
module.platform.random_password.k3s_token: Refreshing state... [id=none]
module.platform.aws_ssm_parameter.k3s_token: Refreshing state... [id=/ai-demo/dev/k3s-token]
module.platform.module.bastion.data.aws_ami.ubuntu: Reading...
module.platform.aws_iam_role.k3s: Refreshing state... [id=ai-demo-dev-role-k3s]
module.platform.aws_iam_role.bastion: Refreshing state... [id=ai-demo-dev-role-bastion]
module.platform.module.network.aws_vpc.main: Refreshing state... [id=vpc-0871da9108e0908be]
module.platform.aws_iam_role_policy_attachment.k3s_ssm_core: Refreshing state... [id=ai-demo-dev-role-k3s-20260310162619871100000001]
module.platform.aws_iam_role_policy.k3s_ssm: Refreshing state... [id=ai-demo-dev-role-k3s:ai-demo-dev-policy-k3s-ssm]
module.platform.aws_iam_instance_profile.k3s: Refreshing state... [id=ai-demo-dev-profile-k3s]
module.platform.aws_iam_role_policy_attachment.bastion_ssm_core: Refreshing state... [id=ai-demo-dev-role-bastion-20260310162619989300000002]
module.platform.aws_iam_role_policy.bastion_ec2_describe: Refreshing state... [id=ai-demo-dev-role-bastion:ai-demo-dev-policy-bastion-ec2]
module.platform.aws_iam_instance_profile.bastion: Refreshing state... [id=ai-demo-dev-profile-bastion]
module.platform.module.bastion.data.aws_ami.ubuntu: Read complete after 1s [id=ami-08ed71ef6c4461a08]
module.platform.module.network.aws_internet_gateway.main: Refreshing state... [id=igw-0a05dde141b17554a]
module.platform.module.network.aws_subnet.private[1]: Refreshing state... [id=subnet-0bfb5f4c3365631ce]
module.platform.module.network.aws_subnet.private[0]: Refreshing state... [id=subnet-0ee442a833406832b]
module.platform.module.network.aws_subnet.public[0]: Refreshing state... [id=subnet-0a07bbdb1739d2545]
module.platform.module.network.aws_security_group.bastion: Refreshing state... [id=sg-0daa30b412509bacf]
module.platform.module.network.aws_route_table.public: Refreshing state... [id=rtb-0f221a629d547cab7]
module.platform.module.network.aws_security_group.k3s: Refreshing state... [id=sg-0dfacb00b177df5d6]
module.platform.module.network.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ae78fa3c61cee1cf]
module.platform.module.bastion.aws_instance.bastion: Refreshing state... [id=i-09d0ef6cc79295560]
module.platform.aws_route_table.private[1]: Refreshing state... [id=rtb-062b637f995f4d6f2]
module.platform.aws_route_table.private[0]: Refreshing state... [id=rtb-050ce466e5153bd2a]
module.platform.module.bastion.aws_eip.bastion: Refreshing state... [id=eipalloc-0ba12a86f8a1f003e]
module.platform.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0d8f92d90b7355702]
module.platform.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-025bc2b9a80deb268]
module.platform.module.k3s_masters.data.aws_ami.ubuntu: Reading...
module.platform.module.k3s_workers.data.aws_ami.ubuntu: Reading...
module.platform.module.k3s_masters.data.aws_ami.ubuntu: Read complete after 0s [id=ami-08ed71ef6c4461a08]
module.platform.module.k3s_masters.aws_instance.master[1]: Refreshing state... [id=i-076c07f51eca95c77]
module.platform.module.k3s_masters.aws_instance.master[0]: Refreshing state... [id=i-0829f25d16cca29b3]
module.platform.module.k3s_workers.data.aws_ami.ubuntu: Read complete after 0s [id=ami-08ed71ef6c4461a08]
module.platform.module.k3s_workers.aws_launch_template.worker: Refreshing state... [id=lt-0f55977043918446e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.platform.module.k3s_workers.aws_autoscaling_group.workers will be created
  + resource "aws_autoscaling_group" "workers" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 4
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 6
      + metrics_granularity              = "1Minute"
      + min_size                         = 0
      + name                             = "ai-demo-dev-k3s-workers-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = [
          + "subnet-0bfb5f4c3365631ce",
          + "subnet-0ee442a833406832b",
        ]
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + availability_zone_distribution (known after apply)

      + capacity_reservation_specification (known after apply)

      + launch_template {
          + id      = "lt-0f55977043918446e"
          + name    = (known after apply)
          + version = "$Latest"
        }

      + mixed_instances_policy (known after apply)

      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "Dev"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "ai-demo-dev-k3s-worker"
        }
      + tag {
          + key                 = "Owner"
          + propagate_at_launch = true
          + value               = "platform-team"
        }
      + tag {
          + key                 = "Service"
          + propagate_at_launch = true
          + value               = "k3s-platform"
        }

      + traffic_source (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```

</details>

> Triggered by @pve159 on `fix/ssm`